using Telegram.Bot.Types.ReplyMarkups;
using System.Collections.Generic;

namespace SPbPUBOT
{
    public class Lists
    {
        public static Dictionary<string, Building> corpsList = new Dictionary<string, Building>()
            {
            {"1", new Building(60.00886241615743, 30.372959872172668)},
            {"2", new Building(60.00854895169126, 30.374680294575548)},
            {"3", new Building(60.00733681418687, 30.38174659067355)},
            {"4", new Building(60.0073021318744, 30.37677768552407)},
            {"5", new Building(59.999737084429896, 30.37479399883527)},
            {"6", new Building(60.00019433679979, 30.36750218452359)},
            {"9", new Building(60.000794280180216, 30.36651880414412)},
            {"10", new Building(60.000654444726905, 30.36938774929456)},
            {"11", new Building(60.009038536792666, 30.378253765812566)},
            {"15", new Building(60.00754416557802, 30.39076324193306)},
            {"16", new Building(60.00816111852203, 30.390334830564584)},
            {"50", new Building(59.99487342599763, 30.357970598553653)},
            {"гз", new Building( 60.007328811066046, 30.372925627721628)},
            {"хим", new Building(60.006694377234744, 30.376412204268018)},
            {"мех", new Building(60.00819071312479, 30.37723832465158)},
            {"г1", new Building(60.005825506006566, 30.382077029584604)},
            {"г2", new Building(60.006780190453576, 30.383418134049354)},
            {"башня", new Building(60.00547030966031, 30.373959278971668)},
            {"лаб", new Building(60.00761905896698, 30.38001514756345)},
            {"спорт", new Building(60.00300617950924, 30.369395673411333)},
        };

        public static Dictionary<string, Building> hostelList = new Dictionary<string, Building>()
            {
            {"1", new Building(59.98617126290759, 30.342262968665914)},
            {"3", new Building(59.98669341345013, 30.343139741623975)},
            {"4, 4а", new Building(59.986248070836155, 30.345619162048934)},
            {"5, 5б", new Building(59.98610080257016, 30.347147499053804)},
            {"6м, 6ф", new Building(59.98680989539412, 30.348108680499955)},
            {"7", new Building(59.986726721704414, 30.342780559971303)},
            {"8", new Building(59.99944800590504, 30.371862528584952)},
            {"10", new Building(59.99883732136135, 30.37029076285841)},
            {"11", new Building(59.985635206066746, 30.344947762932375)},
            {"12", new Building(59.998931293746466, 30.375943010050808)},
            {"13", new Building(60.008675581089946, 30.39184988501699)},
            {"14", new Building(59.99977463563564, 30.37479399855382)},
            {"15", new Building(60.00720863501208, 30.39042150981341)},
            {"16", new Building(60.0476944419641, 30.334509298603013)},
            {"17", new Building(60.02180243413012, 30.388281680260143)},
            {"18", new Building(60.02204903378015, 30.387305356224907)},
            {"19", new Building(59.859136752342174, 30.326863343136655)},
            {"20", new Building(59.91169285413364, 30.320172665843778)},
        };

        public static Dictionary<string, string> pointsList = new Dictionary<string, string>()
            {
            {"2021", "D:/Телеграм бот/SPbPUBOT/SPbPUBOT/Файлы/Баллы/2021.pdf"},
            {"2020", "D:/Телеграм бот/SPbPUBOT/SPbPUBOT/Файлы/Баллы/2020.pdf"},
            {"2019", "D:/Телеграм бот/SPbPUBOT/SPbPUBOT/Файлы/Баллы/2019.pdf"},
            {"2018", "D:/Телеграм бот/SPbPUBOT/SPbPUBOT/Файлы/Баллы/2018.pdf"},
            {"2017", "D:/Телеграм бот/SPbPUBOT/SPbPUBOT/Файлы/Баллы/2017.pdf"},
            {"2016", "D:/Телеграм бот/SPbPUBOT/SPbPUBOT/Файлы/Баллы/2016.pdf"},
        };
    }
}
